2D_planar_flame/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingThickenedFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2037736458;

deltaT          1.1e-06;

maxDeltaT       1e-06;

writeControl    timeStep;

writeInterval   1575;

purgeWrite      0;

writeFormat     binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

adjustTimeStep  no;

functions
{
    #includeFunc    Qdot(executeControl=timeStep)
    #includeFunc    graphCellFn
    #includeFunc    volIntegrateFn(fields=(Qdot))
    #includeFunc    averageMolarWeightFn
    #includeFunc    patchIntegrate(operation=sum,patch=inlet,fields=(rho),writeControl=writeTime)
    #includeFunc    patchIntegrate(operation=sum,patch=outlet,fields=(rho),writeControl=writeTime)
    #includeFunc    patchIntegrate(operation=sum,patch=inlet,fields=(h),writeControl=writeTime)
    #includeFunc    patchIntegrate(operation=sum,patch=outlet,fields=(h),writeControl=writeTime)
    #includeFunc    frequentWriteFn
    #includeFunc    consumptionSpeed
}

libs            ( "libchemistryModel_DLB.so" "libODE_DLB.so" "$FOAM_CASE/mech/libc_pyjac.so" "libmoreDiffusion.so" );


// ************************************************************************* //
