2D_planar_flame/system/blockMeshDict_1D.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

Lx               0.03;
Nx               4000;

W               0.0001;
X0              0;
X1              $Lx;

Y0              #calc " - $W / 2.0";
Y1              #calc "   $W / 2.0";

Z0              $Y0;
Z1              $Y1;

vertices
(
    ( $X0 $Y0 $Z0 )
    ( $X0 $Y0 $Z1 )
    ( $X1 $Y0 $Z0 )
    ( $X1 $Y0 $Z1 )
    ( $X0 $Y1 $Z0 )
    ( $X0 $Y1 $Z1 )
    ( $X1 $Y1 $Z0 )
    ( $X1 $Y1 $Z1 )
);

blocks
(
    hex ( 0 2 6 4 1 3 7 5 ) ( $Nx 1 1 ) simpleGrading ( 1 1 1 )
);

edges
(
);

boundary (
    inlet
    {
        type patch;
        faces
        (
            ( 0 1 5 4 )
        );
    }
    outlet
    {
        type patch;
        faces
        (
            ( 2 6 7 3 )
        ) ;
    }
    empty {
        type empty ;
        faces
        (
            ( 0 2 3 1 )
            ( 1 5 7 3 )
            ( 4 5 7 6 )
            ( 0 4 6 2 )
        ) ;
    }
);

mergePatchPairs ( );


// ************************************************************************* //
