2D_planar_flame/constant/LewisNumbersDict
N2       1.3424973537555802;
H2       0.3458714466493076;
H        0.22709958423122456;
O2       1.3368188769390295;
O        0.8418403471007512;
H2O      1.1002737443636996;
OH       0.8576592100206509;
H2O2     1.3154302847257704;
HO2      1.306710597045766;
NO       1.3249046362210324;
N2O      1.6935035667521703;
N        0.9438871842471943;
NH       0.7991245140884959;
NNH      1.3351983777442489;
NH2      0.8158632450573781;
