2D_planar_flame/constant/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          thermophysicalTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

laminar
{
    model           FickianFourier;
    mixtureDiffusionCoefficients no;
    writeDmi        no;
    D
    {
        #include        "binaryDiffusionCoefficientsPolynomialDict"
    }
}


// ************************************************************************* //
