2D_planar_flame/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "planarMappingDict"

#include "readInletValue.H";
#include "readInternalVectorXField.H"

internalField nonuniform $internalVectorXField;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ($inletValue 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    "top|bottom"
    {
        type cyclic;

    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
