2D_planar_flame/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

p               101325;

lInf_distance   0.08064;

internalField   uniform $p;

boundaryField
{
    inlet
    {
        type            waveTransmissive;
        value           $internalField;
        field           p;
        gamma           1.39967;
        lInf            $lInf_distance;
        fieldInf        $p;
    }
    outlet
    {
        type            waveTransmissive;
        value           $internalField;
        field           p;
        gamma           1.28101;
        lInf            $lInf_distance;
        fieldInf        $p;
    }
    "top|bottom"
    {
        type            cyclic;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
