2D_planar_flame/0/SPECIES
species="
H2
H
O2
O
H2O
OH
H2O2
HO2
NO
N2O
N
NH
NNH
NH2
N2
"
