2D_planar_flame/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss cubic;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedCubicV 0;
    div(phi,Yi_h)   Gauss limitedCubic  0;
    div(phi,K)      Gauss limitedCubic  0;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss cubic;
    div(heatFluxCorr)   Gauss cubic; // for reactingLeFoam
    div(((mixMu+(rho*nut))*dev2(grad(U).T()))) Gauss cubic; // for reactingDNS
    div(vk) Gauss cubic; // for reactingDNS
}

laplacianSchemes
{
    default         Gauss cubic orthogonal;
}

interpolationSchemes
{
    default         cubic;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
