2D_planar_flame/system/add
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Add a list of fields.

\*---------------------------------------------------------------------------*/

type            add;
libs            ("libfieldFunctionObjects.so");

fields          (<fieldNames>);

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
