2D_planar_flame/system/consumptionSpeed
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the shear stress at wall patches, outputting the data as a
    volVectorField.

\*---------------------------------------------------------------------------*/

type            consumptionSpeed;
libs            ("libconsumption.so");

writeControl    timeStep;
writeInterval   20;

patches         ("inlet");
F               1;


// ************************************************************************* //
