2D_planar_flame/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    note            "mesh decomposition control dictionary";
    object          decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 512;

method          multiLevel;

simpleCoeffs
{
    n               ( $numberOfSubdomains 1 1 );
    delta           1e-10;
}

multiLevelCoeffs
{
    nodes
    {
        numberOfSubdomains 4;
        method          simple;
        n               ( 2 2 1 );
        delta           1e-10;
    }
    cpus
    {
        numberOfSubdomains 128;
        method          simple;
        n               ( 8 16 1 );
        delta           1e-10;
    }
}


// ************************************************************************* //
