2D_planar_flame/system/graphCellFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
start           ( -0.001 0 0 );

end             ( 1 0 0 );

fields          ( "U" "Qdot" "N2" "O2" "NH" "T" "H" "OH" "H2" "H2O" "NH3" );

axis            x;

writeControl    timeStep;

writeInterval   19;

#includeEtc     "caseDicts/postProcessing/graphs/graphCell.cfg"


// ************************************************************************* //
