2D_planar_flame/system/graphCellMappingFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. One graph point is generated in each cell that the line
    intersects.

\*---------------------------------------------------------------------------*/

start           (-0.001 0 0);
end             ( 1     0 0);

fields ( 
    T
    Qdot
    U
    AR
    HE
    H2
    H
    O2
    O
    H2O
    OH
    H2O2
    HO2
    NO
    N2O
    NO2
    HNO
    HNO2
    HONO
    HONO2
    N2H2
    H2NN
    NH2OH
    HNOH
    NH3
    N2H4
    N
    NO3
    NH
    NNH
    NH2
    H2NO
    N2H3
    N2
);

axis            x;

#includeEtc "caseDicts/postProcessing/graphs/graphCell.cfg"

// ************************************************************************* //
