2D_planar_flame/system/sf

         type            surfaceFieldValue;
         libs            ("libfieldFunctionObjects.so");
 
         log             true;
         writeControl    writeTime;
         writeFields     true;
 
         surfaceFormat   none;
         regionType      patch;
         name            outlet;
 
    operation       areaAverage;
    fields             ("NO");

