2D_planar_flame/system/singleGraphFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

start           (0 0 0);
end             (1 0 0);

fields ( 
    "U" 
    "Qdot" 
    "N2" 
    "O2" 
    "NH" 
    "T" 
    "H" 
    "OH" 
    "H2" 
    "H2O" 
    "NH3"
);

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

setConfig
{
    type    lineCell; // lineCell, lineCellFace
    axis    x;    // x, y, z, xyz
}

// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
