2D_planar_flame/system/volIntegrateFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            volFieldValue;
libs            ("libfieldFunctionObjects.so");
operation       volIntegrate;

log             true;

writeControl    timeStep;
writeInterval   1;

writeFields     false;

regionType      all;

// ************************************************************************* //
